import logging as log_obj
logger = log_obj.getLogger("gmaj")


ErrorCodeMsg = {
                # 用户登录
                "10000001": "Post信息解析失败",
                "10000002": "缺少参数: login",
                "10000003": "缺少参数: password",
                "10000004": "缺少参数: role",
                "10000005": "账号未注册",
                "10000006": "账号和密码不一致",
                "10000007": "账号被禁用",
                "10000008": "不允许在当前终端登录",
                "10000009": "无法生成Token信息",
                # 用户登出
                "10001001": "Post信息解析失败",
                "10001002": "缺少参数: login",
                "10001003": "缺少参数: token",
                "10001004": "Token信息解析失败",
                "10001005": "账号未登录或登录超时",
                "10001006": "Token信息删除失败",
                # 新增用户信息
                "10002006": "缺少参数: login",
                "10002007": "账号已被注册",
                "10002008": "缺少参数: password",
                "10002009": "缺少参数: nickname",
                "10002010": "缺少参数: dept",
                "10002011": "缺少参数: default_group",
                "10002012": "缺少参数: enable",
                "10002013": "缺少参数: role",
                "10002014": "缺少参数: latitude",
                "10002015": "缺少参数: longitude",
                "10002016": "缺少参数: height",
                "10002017": "缺少参数: locate",
                "10002018": "缺少参数: sip_server",
                "10002019": "用户信息存储失败",
                "10002020": "用户Sip信息存储失败",
                # 修改用户信息
                "10003005": "缺少参数: id",
                "10003006": "没有修改用户信息的权限",
                "10003007": "账号不存在",
                "10003008": "用户信息更新失败",
                # 查询用户信息
                # 10004001--05
                # 删除用户信息
                "10005005": "缺少参数: id",
                "10005006": "没有删除用户信息的权限",
                "10005007": "用户信息不存在",
                "10005008": "不允许删除Admin账号",
                "10005009": "用户信息删除失败",


                # 新增部门信息
                "11001006": "缺少参数: name",
                "11001007": "缺少参数: pid",
                "11001008": "缺少参数: enable",
                "11001009": "无法找到父部门的信息",
                "11001010": "部门信息存储失败",
                # 修改部门信息
                "11002006": "缺少参数: id",
                "11002007": "无法找到父部门的信息",
                "11002008": "部门信息更新失败",
                # 查询部门信息
                "11003005": "部门信息查询失败",
                # 删除部门信息
                "11004006": "缺少参数: id",
                "11004007": "子部门信息存在, 不允许删除",
                "11004008": "成员信息存在, 不允许删除",
                "11004009": "部门信息删除失败",
                "11004010": "监控设备信息存在, 不允许删除",
                # 查询部门成员信息
                "11005005": "缺少参数: id",
                "11005006": "部门成员信息查询失败",
                # 子部门信息排序
                "11006006": "缺少参数: id",
                "11006007": "缺少参数: sub",
                "11006008": "子部门信息排序失败",
                # 部门成员信息排序
                "11007006": "缺少参数: id",
                "11007007": "缺少参数: member",
                "11007008": "部门成员信息排序失败",
                # 部门设备信息排序
                "11008006": "缺少参数: id",
                "11008007": "部门设备信息查询失败",
                "11008008": "部门设备信息获取失败",

                # 新增IOT设备信息
                "14001006": "缺少参数: dept",
                "14001007": "缺少参数: code",
                "14001008": "缺少参数: flag",
                "14001009": "缺少参数: ipc",
                "14001010": "缺少参数: generic_plan",
                "14001011": "缺少参数: name",
                "14001012": "缺少参数: device_typer",
                "14001013": "缺少参数: gateway_server_id",
                "14001014": "缺少参数:gateway_server",
                "14001015": "缺少参数: enable",
                "14001016": "缺少参数: iot_device_code",
                "14001017": "缺少参数: latitude",
                "14001018": "缺少参数: longitude",
                "14001019": "缺少参数: height",
                "14001020": "缺少参数: iot_address",
                "14001021": "iot物联网平台绑定失败",
                "14001022": "iot设备信息添加失败 ",
                "14001023": "Lora平台信息获取失败",
                "14001024": "缺少参数: device_type_name",
                "14001025": "缺少参数: device_brand_names",
                "14001026": "Lora平台信息组装失败",

                # 修改IOT设备信息
                "14002006": "缺少参数: id",
                "14002007": "Sip号码范围: 400--499",
                "14002008": "已存在默认网关且数量只能为1",
                "14002009": "IOT设备信息不存在",
                "14002010": "IOT设备信息更新失败",
                # 查询IOT设备信息
                "14003005": "缺少参数: id",
                "14003006": "IOT设备信息查询失败",
                # 删除IOT设备信息
                "14004006": "缺少参数: id",
                "14004007": "IOT设备信息不存在",
                "14004008": "IOT物联网平台注销失败",
                "14004009": "IOT设备信息删除失败",
                # 查询IOT设备的历史实时数据
                "14005006": "缺少参数: dept",
                "14005007": "IOT设备数据查询失败",
                # 查询IoT设备告警数据
                "14006006": "缺少参数: dept",
                "14006007": "查询IoT设备告警数据失败",
                # 查询IOT设备的在线率
                "14007006": "缺少参数: dept",
                "14007007": "查询IoT设备在线率失败",
                # 告警处置预案信息添加
                "14008006": "缺少参数: user",
                "14008007": "缺少参数: user",
                "14008008": "缺少参数: content",
                "14008009": "缺少参数: type",
                "14008010": "缺少参数: time",
                "14008011": "告警处置预案信息添加失败",
                # 告警处置预案信息修改
                "14009006": "缺少参数: id",
                "14009007": "要修改的信息不存在",
                "14009008": "告警处置预案信息修改失败",
                # 告警处置预案信息查询
                "14010006": "告警处置预案信息查询失败",
                # 告警处置预案信息删除
                "14011006": "缺少参数: id",
                "14011007": "要删除的信息不存在",
                "14011008": "告警处置预案信息删除失败",
                # 查询IOT设备的告警数据
                "14012006": "缺少参数: iot_type",
                "14012007": "IOT设备告警数据查询失败",
                # "14012008": "IOT设备信息查询失败",
                # "14012009": "IOT设备责任人信息查询失败",
                # "14012010": "IOT设备关联短信模板信息查询失败",
                # "14012011": "IOT设备告警短信发送失败",
                # 查询IOT实时数据
                "14013006": "缺少参数: code",
                "14013007": "IOT设备实时数据查询失败",
                # 查询IOT实时数据
                "14014006": "缺少参数: dept",
                "14014007": "IOT设备告警次数查询失败",
                #查询AI设备信息
                "14015006": "ai设备信息查询失败",
                #新增AI设备信息
                "14016006": "缺少参数: dept",
                "14016007": "缺少参数: code",
                "14016008": "缺少参数: locate",
                "14016009": "缺少参数: generic_plan",
                "14016010": "缺少参数: name",
                "14016011": "缺少参数: enable",
                "14016012": "ai设备信息创建失败",
                #修改AI设备信息
                "14017006": "缺少参数: id",
                "14017007": "Ai设备信息不存在",
                "14017008": "Ai设备信息修改失败",
                #删除AI设备信息
                "14018006": "缺少参数: id",
                "14018007": "Ai设备信息不存在",
                "14018008": "Ai设备信息解绑失败",
                "14018009": "Ai设备信息删除失败",
                # 查询全部AI分析告警信息
                "14019006": "告警信息查询失败",
                # 查询AI分析告警信息(一周)
                "14020006": "告警信息查询失败",
                # 查询AI分析告警信息(一天)
                "14021006": "告警信息查询失败",
                # 查询告警数据（柱状图。扇形图）
                "14022006": "告警信息查询失败",
                # 新增Rtsp服务信息
                "16001006": "缺少参数: name",
                "16001007": "缺少参数: ip",
                "16001008": "缺少参数: port",
                "16001009": "缺少参数: user",
                "16001010": "缺少参数: password",
                "16001011": "缺少参数: channels",
                "16001012": "缺少参数: type",
                "16001013": "缺少参数: enable",
                "16001014": "Rtsp服务信息创建失败",
                # 修改Rtsp服务信息
                "16002006": "缺少参数: id",
                "16002007": "Rtsp服务信息不存在",
                "16002008": "Rtsp服务信息更新失败",
                # 查询Rtsp服务信息
                "16003005": "缺少参数: id",
                "16003006": "Rtsp服务信息查询失败",
                # 删除Rtsp服务信息
                "16004006": "缺少参数: id",
                "16004007": "Rtsp服务信息不存在",
                "16004008": "Rtsp服务信息删除失败",

                # 新增Rtsp设备信息
                "17001002": "缺少参数: name",
                "17001003": "缺少参数: dept",
                "17001004": "缺少参数: type",
                "17001005": "缺少参数: server",
                "17001006": "缺少参数: channel",
                "17001007": "缺少参数: enable",
                "17001008": "缺少参数: longitude",
                "17001009": "缺少参数: latitude",
                "17001010": "缺少参数: height",
                "17001011": "缺少参数: locate",
                "17001012": "缺少参数: manufacturer_type",
                "17001013": "缺少参数: permissions_info",
                "17001014": "缺少参数: channel_type",
                "17001015": "缺少参数: inter_code_SN",
                "17001016": "缺少参数: multicast_ip",
                "17001017": "缺少参数: multicast_port",
                "17001018": "Rtsp设备信息创建失败",
                # 修改Rtsp设备信息
                "17002006": "缺少参数: id",
                "17002007": "Rtsp设备信息不存在",
                "17002008": "Rtsp设备信息更新失败",
                # 查询Rtsp设备信息(部门ID)
                "17003005": "缺少参数: id",
                "17003006": "Rtsp设备信息查询失败",
                # 查询Rtsp设备信息(设备ID)
                "17004005": "缺少参数: id",
                "17004006": "Rtsp设备信息查询失败",
                # 删除Rtsp设备信息
                "17005006": "缺少参数: id",
                "17005007": "Rtsp设备信息不存在",
                "17005008": "Rtsp设备信息删除失败",
                # Rtsp设备信息排序
                "17006006": "缺少参数: id",
                "17006007": "缺少参数: devices",
                "17006008": "Rtsp设备信息排序失败",
                # Rtsp设备轮询信息添加
                "17007006": "缺少参数: user",
                "17007007": "缺少参数: devices",
                "17007008": "轮询列表信息添加失败<数据删除失败>",
                "17007009": "轮询列表信息添加失败",
                # Rtsp设备轮询信息查询
                "17008006": "缺少参数: user",
                "17008007": "轮询列表信息查询失败",
                # Rtsp设备录像信息添加
                "17009006": "缺少参数: device",
                "17009007": "缺少参数: user",
                "17009008": "缺少参数: type",
                "17009009": "缺少参数: record_code",
                "17009010": "录像信息添加失败",
                # Rtsp设备录像信息查询
                "17010006": "缺少参数: device",
                "17010007": "录像信息查询失败",
                # AI rtsp 设备信息新增
                "17011006": "缺少参数: ai_id",
                "17011007": "缺少参数: name",
                "17011008": "缺少参数: dept",
                "17011009": "缺少参数: code",
                "17011010": "缺少参数: enable",
                "17011011": "缺少参数: locate",
                "17011012": "缺少参数: channer",
                "17011013": "AI rtsp设备新建失败",
                # AI rtsp 设备信息修改
                "16012006": "缺少参数: id",
                "16012007": "AI Rtsp服务信息不存在",
                "16012008": "AI Rtsp服务信息更新失败",
                # 查询Rtsp设备信息(全部)
                "17013006": "AI Rtsp设备信息查询失败",
                # 删除AI Rtsp设备信息
                "17014006":"缺少参数: id" ,
                "17014007":"AI Rtsp设备信息不存在" ,
                "17014008": "AI Rtsp设备信息删除失败",
                # AI Rtsp设备录像信息查询
                "17015006":"录像信息查询失败" ,
                # 重大危险源信息添加
                "18001006": "缺少参数: unit_name",
                "18001007": "缺少参数: address",
                "18001008": "缺少参数: region",
                "18001009": "缺少参数: contact",
                "18001010": "缺少参数: phone",
                "18001011": "缺少参数: type",
                "18001012": "缺少参数: name",
                "18001013": "缺少参数: level",
                "18001014": "重大危险源信息添加失败",
                # 重大危险源信息修改
                "18002006": "缺少参数: id",
                "18002007": "要修改的信息不存在",
                "18002008": "重大危险源信息修改失败",
                # 重大危险源信息查询
                "18003006": "重大危险源信息查询失败",
                # 重大危险源信息删除
                "18004006": "缺少参数: id",
                "18004007": "要删除的信息不存在",
                "18004008": "重大危险源信息删除失败",

                # 安全生产许可信息添加
                "18005006": "缺少参数: type",
                "18005007": "缺少参数: name",
                "18005008": "缺少参数: code",
                "18005009": "缺少参数: result",
                "18005010": "缺少参数: organization",
                "18005011": "缺少参数: time",
                "18005012": "缺少参数: validity",
                "18005013": "安全生产许可信息添加失败",
                # 安全生产许可信息修改
                "18006006": "缺少参数: id",
                "18006007": "要修改的信息不存在",
                "18006008": "安全生产许可信息修改失败",
                # 安全生产许可信息查询
                "18007006": "安全生产许可信息查询失败",
                # 安全生产许可信息删除
                "18008006": "缺少参数: id",
                "18008007": "要删除的信息不存在",
                "18008008": "重大危险源信息删除失败",

                # 企业基本信息添加
                "18009006": "缺少参数: name",
                "18009007": "缺少参数: type",
                "18009008": "缺少参数: address",
                "18009009": "缺少参数: corporate_name",
                "18009010": "缺少参数: corporate_job",
                "18009011": "缺少参数: corporate_phone",
                "18009012": "缺少参数: safety_name",
                "18009013": "缺少参数: safety_job",
                "18009014": "缺少参数: safety_phone",
                "18009015": "企业基本信息添加失败",
                # 企业基本信息修改
                "18010006": "缺少参数: id",
                "18010007": "要修改的信息不存在",
                "18010008": "企业基本信息修改失败",
                # 企业基本信息查询
                "18011006": "企业基本信息查询失败",
                # 企业基本信息删除
                "18012006": "缺少参数: id",
                "18012007": "要删除的信息不存在",
                "18012008": "企业基本信息删除失败",

                # 预案信息添加
                "18013006": "缺少参数: plan_name",
                "18013007": "缺少参数: plan_time",
                "18013008": "缺少参数: scheme_name",
                "18013009": "缺少参数: scheme_time",
                "18013010": "缺少参数: commanding_organization",
                "18013011": "缺少参数: risk_assessment",
                "18013012": "缺少参数: commander_name",
                "18013013": "缺少参数: commander_phone",
                "18013014": "缺少参数: resource_investigation",
                "18013015": "缺少参数: plan_record",
                "18013016": "预案信息添加失败",
                # 预案信息修改
                "18014006": "缺少参数: id",
                "18014007": "要修改的信息不存在",
                "18014008": "预案信息修改失败",
                # 预案信息查询
                "18015006": "预案信息查询失败",
                # 预案信息删除
                "18016006": "缺少参数: id",
                "18016007": "要删除的信息不存在",
                "18016008": "预案信息删除失败",

                # 隐患信息添加
                "18017006": "缺少参数: code",
                "18017007": "缺少参数: source",
                "18017008": "缺少参数: type",
                "18017009": "缺少参数: describe",
                "18017010": "缺少参数: level",
                "18017011": "缺少参数: status",
                "18017012": "缺少参数: dept",
                "18017013": "缺少参数: enterprise",
                "18017014": "缺少参数: reporter",
                "18017015": "缺少参数: time",
                "18017016": "隐患信息添加失败",
                # 隐患信息修改
                "18018006": "缺少参数: id",
                "18018007": "要修改的信息不存在",
                "18018008": "隐患信息修改失败",
                # 隐患信息查询
                "18019006": "隐患信息查询失败",
                # 隐患信息删除
                "18020006": "缺少参数: id",
                "18020007": "要删除的信息不存在",
                "18020008": "隐患信息删除失败",

                # 行政执法信息添加
                "18021006": "缺少参数: code",
                "18021007": "缺少参数: enterprise",
                "18021008": "缺少参数: address",
                "18021009": "缺少参数: corporate_name",
                "18021010": "缺少参数: corporate_job",
                "18021011": "缺少参数: corporate_phone",
                "18021012": "缺少参数: place",
                "18021013": "缺少参数: begin_time",
                "18021014": "缺少参数: end_time",
                "18021015": "缺少参数: checkers",
                "18021016": "缺少参数: checkerIDs",
                "18021017": "行政执法信息添加失败",
                # 行政执法信息修改
                "18022006": "缺少参数: id",
                "18022007": "要修改的信息不存在",
                "18022008": "行政执法信息修改失败",
                "18022009": "执行人信息修改失败",
                # 行政执法信息查询
                "18023006": "行政执法信息查询失败",
                # 行政执法信息删除
                "18024006": "缺少参数: id",
                "18024007": "要删除的信息不存在",
                "18024008": "行政执法信息删除失败",
                # 隐患信息查询
                "18025006": "隐患信息查询失败",
                # 事件上报
                "18026006": "缺少参数: authorName",
                "18026007": "缺少参数: authorCode",
                "18026008": "缺少参数: eventCode",
                "18026009": "缺少参数: address",
                "18026010": "缺少参数: describe",
                "18026011": "缺少参数: channelNo",
                "18026012": "缺少参数: formNo",
                "18026013": "缺少参数: userName",
                "18026014": "缺少参数: userName",
                "18026015": "事件上报失败",
                "18026016": "事件调用失败",
                #行政处罚信息新增
                "18027006": "缺少参数: administration_name",
                "18027007": "缺少参数: administration_type",
                "18027008": "缺少参数: administration_punish_number",
                "18027009": "缺少参数: lllegal_type",
                "18027010": "缺少参数: lllegal_fact",
                "18027011": "缺少参数: punishment_basis",
                "18027012": "缺少参数: punishment_type",
                "18027013": "缺少参数: punishment_content",
                "18027014": "缺少参数: punish_date",
                "18027015": "缺少参数: punish_valid_date",
                "18027016": "缺少参数: penalty_authorities",
                "18027017": "缺少参数: penalty_authorities_code",
                "18027018": "缺少参数: data_source",
                "18027019": "data_source_code",
                "18027020": "行政处罚信息新增失败",
                #行政处罚信息修改
                "18028006": "缺少参数: id",
                "18028007": "要修改的信息不存在",
                "18028008": "行政处罚信息修改失败",
                #行政处罚信息查询
                "18029006": "行政处罚信息查询失败",
                #行政处罚信息删除
                "18030006": "缺少参数: id",
                "18030007": "要删除的信息不存在",
                "18030008": "行政处罚信删除失败",
                # 行政处罚信息批量新增
                "18031006": "缺少参数: administration_name",
                "18031007": "缺少参数: administration_type",
                "18031008": "缺少参数: administration_punish_number",
                "18031009": "缺少参数: lllegal_type",
                "18031010": "缺少参数: lllegal_fact",
                "18031011": "缺少参数: punishment_basis",
                "18031012": "缺少参数: punishment_type",
                "18031013": "缺少参数: punishment_content",
                "18031014": "缺少参数: punish_date",
                "18031015": "缺少参数: punish_valid_date",
                "18031016": "缺少参数: penalty_authorities",
                "18031017": "缺少参数: penalty_authorities_code",
                "18031018": "缺少参数: data_source",
                "18031019": "data_source_code",
                "18031020": "行政处罚信息新增失败",
                "18031021": "缺少参数: infoList",

                # SMS信息发送
                "19001006": "缺少参数: user_list",
                "19001007": "缺少参数: content",
                "19001008": "短信平台请求失败",
                "19001009": "短信发送失败",
                "19001010": "短信记录保存失败",
                # SMS模板信息添加
                "19002006": "缺少参数: user",
                "19002007": "缺少参数: name",
                "19002008": "缺少参数: content",
                "19002009": "缺少参数: type",
                "19002010": "SMS模板信息添加失败",
                # SMS模板信息修改
                "19003006": "缺少参数: id",
                "19003007": "要修改的信息不存在",
                "19003008": "SMS模板信息修改失败",
                # SMS模板信息查询
                "19004006": "SMS模板信息查询失败",
                # SMS模板信息删除
                "19005006": "缺少参数: id",
                "19005007": "要删除的信息不存在",
                "19005008": "SMS模板信息删除失败",
                # SMS信息记录查询
                "19006006": "SMS信息记录查询失败",

                # 查询用户操作信息
                "23002006": "用户操作信息查询失败",

                # 查询用户操作信息
                "24001006": "缺少参数: login",
                "24001007": "缺少参数: data",
                "24001008": "用户数据存储失败",
                # 查询用户操作信息
                "24002006": "缺少参数: login",
                "24002007": "用户数据查询失败",
}


def getErrMsgByCode(err_code, err_obj):
    """
    错误码--获取
    :return:
    """
    str_err_code = str(err_code)

    if err_obj is None:
        err_msg = ErrorCodeMsg[str_err_code]
    else:
        if int(str_err_code[7]) == 1:
            err_msg = "Post信息解析失败" + "<" + format(err_obj) + ">"
        else:
            err_msg = ErrorCodeMsg[str_err_code] + "<" + format(err_obj) + ">"

    logger.error(err_msg)

    return err_msg

